<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="x.1" type="Parameter" version="opset1">
			<data shape="?,?" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="x.1">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_11_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="20, 6" offset="0" size="240" />
			<output>
				<port id="0" precision="FP16" names="9,weight.2">
					<dim>20</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_11" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>20</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="aten::linear/MatMul_7" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_1213_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 20" offset="240" size="40" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_1213" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="10">
					<dim>-1</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="4_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="280" size="2" />
			<output>
				<port id="0" precision="FP16" names="4" />
			</output>
		</layer>
		<layer id="8" name="4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="9" name="aten::leaky_relu/PRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="11,input.1">
					<dim>-1</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_18_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="6, 20" offset="282" size="240" />
			<output>
				<port id="0" precision="FP16" names="13,weight.1">
					<dim>6</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_18" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>6</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>6</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="aten::linear/MatMul_9" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>6</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_1214_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 6" offset="522" size="12" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_1214" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="aten::linear/Add_10" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Result_21" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="1" />
		<edge from-layer="3" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="15" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="1" />
		<edge from-layer="15" from-port="2" to-layer="16" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2023.2.0-13089-cfd42bd2cb0-HEAD" />
		<conversion_parameters>
			<framework value="pytorch" />
			<is_python_object value="True" />
		</conversion_parameters>
	</rt_info>
</net>
